## Pandas Day - 19

## apply() function 
- **apply()** is used to apply a function to rows or columns of a DataFrame.

In [1]:
import pandas as pd

### Creating Sample DataFrame

In [7]:
df = pd.DataFrame({
    "Name": ["Amit", "Bhavesh", "Pranay", "Priya"],
    "Marks": [85, 78, 90, 88]
})

### apply() on a Column

In [4]:
df["Marks_plus_5"] = df["Marks"].apply(lambda x: x + 5)
df

      Name  Marks  Marks_plus_5
0     Amit     85            90
1  Bhavesh     78            83
2   Pranay     90            95
3    Priya     88            93

### apply() with Custom Function

In [8]:
def grade(marks):
    if marks >= 85:
        return "A"
    elif marks >= 75:
        return "B"
    else:
        return "C"

In [9]:
df["Grade"] = df["Marks"].apply(grade)
df

      Name  Marks Grade
0     Amit     85     A
1  Bhavesh     78     B
2   Pranay     90     A
3    Priya     88     A

### apply() on Rows (axis=1)

In [10]:
df["Result"] = df.apply(
    lambda row: "Pass" if row["Marks"] >= 80 else "Fail",
    axis=1
)
df

      Name  Marks Grade Result
0     Amit     85     A   Pass
1  Bhavesh     78     B   Fail
2   Pranay     90     A   Pass
3    Priya     88     A   Pass

### apply() on Columns (axis=0)

In [11]:
df[["Marks"]].apply("mean")

Marks    85.25
dtype: float64